T = int(input())
for tc in range(1, T + 1):
    N, M = map(int, input().split())

    # 마지막 N 비트가 모두 1인지 확인
    # M & ((1 << N) - 1) : 마지막 N비트 추출
    # (1 << N) - 1 : (2의 N승) -1 과 같은지 확인 (마지막 N비트가 모두 1인지 확인)
    if M & ((1 << N) - 1) == (1 << N) - 1:
        result = "ON"
    else:
        result = "OFF"

    print(f"#{tc} {result}")

# 1 / 0 & 01111 (= 10000 - 1) != 01111 -> 결과: OFF
# 2 / 11110 & 01111 (= 10000 - 1) != 01111 -> 결과: OFF
# 3 / 101111 & 01111 (= 10000 - 1) == 01111 -> 결과: ON
# 4 / 11111 & 011111 (= 100000 - 1) == 011111 -> 결과: ON
# 5 / 111110 & 011111 (= 100000 - 1) != 011111 -> 결과: OFF

